"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая вернет результат сложения цифр целого числа

ПРИМЕРЫ
--------------------------------------------------------------------------------
num_sum(5216) -> 14
num_sum(58716) -> 27
num_sum(321) -> 6
"""


def num_sum(numb: int) -> int:
    summa = 0
    while numb > 0:
        digit = numb % 10
        summa = summa + digit
        numb = numb // 10
    return summa



if __name__ == '__main__':
    assert num_sum(5216) == 14
    print('Решено!')
